import React from "react";

class Main extends Component {
  render() {
    const actors = [
      "Метью Макконахі",
      "Енн Гетевей",
      "Джессіка Честейн",
      "Білл Ірвін",
      "Еллен Берстін",
      "Майкл Кейн",
      "Метт Деймон",
      "Кейсі Аффлек",
      "Тімоті Шаламе",
    ];

    return (
      <main className="main">
        <section className="story">
          <h2>Інтерстелер</h2>

          <p>
            У майбутньому Земля потерпає від екологічної катастрофи: засуха, пилові бурі та
            невиліковна хвороба рослин знищують запаси їжі, прирікаючи людство на вимирання.
          </p>

          <p>
            Колишній пілот НАСА Купер випадково знаходить секретну лабораторію, де вчені під
            керівництвом професора Бренда розробляють план порятунку. Біля Сатурна виявлено таємничу
            «кротову нору» (червоточину), яка веде в іншу галактику, де є потенційно придатні для
            життя планети.
          </p>

          <p>
            Купер залишає на Землі своїх дітей і очолює космічну місію на кораблі «Ендуранс». Разом
            із командою науковців він досліджує три різні світи. Через колосальне гравітаційне
            уповільнення часу поблизу чорної діри Гаргантюа, кожна година для астронавтів
            обертається роками й десятиліттями на Землі. Його донька Мерф виростає і стає вченою,
            намагаючись розгадати рівняння гравітації для евакуації людства.
          </p>

          <p>
            Пройшовши крізь зраду, втрати та небезпеки, Купер падає в саму чорну діру. Там він
            опиняється у п'ятивимірному просторі (тесеракті), створеному майбутнім людством. Цей
            простір візуалізований як кімната його доньки крізь час. Купер розуміє, що саме він був
            тим «привидом» із дитинства Мерф. За допомогою гравітаційних аномалій та азбуки Морзе
            він передає дорослій Мерф квантові дані з чорної діри.
          </p>

          <p>
            Мерф розгадує рівняння, рятує людей із Землі, а Купера зрештою знаходять у космосі через
            багато років, де він нарешті зустрічається зі своєю вже престарілою донькою перед новою
            подорожжю.
          </p>
        </section>

        <section className="actors">
          <h2>Актори</h2>
          <ul>
            {actors.map((actor, index) => (
              <li key={index}>{actor} </li>
            ))}
          </ul>
        </section>

        <section className="info">
          <h2>Загальна інформація</h2>

          <ul>
            <li>Країна: США, Велика Британія</li>

            <li>
              Студія: Paramount Pictures, Warner Bros. Pictures, Legendary Pictures, Syncopy, Lynda
              Obst Productions
            </li>

            <li>Жанр: наукова фантастика, драма, пригоди</li>

            <li>Рік випуску: 2014</li>
          </ul>
        </section>
      </main>
    );
  }
}

export default Main;
